{
  "personal": {
    "name": "Zi Yang",
    "first_name": "Zi",
    "email": "zi.yang0009@gmail.com​",
    "location": "Orange County, California, United States",
    "phone": "(832)640-4347"
  },
  "professional": {
    "title_1": "Data Analyst",
    "title_2": "Data Scientist",
    "techs": "NumPy, Pandas, Matplotlib, Seaborn, Flask, SciPy, Scikit-learn, SQL, HTML, CCS, AWS (EC2), Unix.",
    "main_self_introduction": "I am a Data Scientist with Engineering Management and Military background. My passion to be a better engineer in my previous careers led me to develop the data analysis skills that I utilize today. I hope to one day work on a team of analysts to discover knowledge that will benefit society and the world.", 
    "top_skills": [
      { "percentage": 70, "skill": "Python" },
      { "percentage": 40, "skill": "SQL" },
      { "percentage": 60, "skill": "Data visualization" },
      { "percentage": 80, "skill": "Machine learning" },
      { "percentage": 30, "skill": "Deep learning" },
      { "percentage": 15, "skill": "Dashboard building" }
    ],
    "languages": [
      { "percentage": 100, "lang": "English" },
      { "percentage": 80, "lang": "Chinese" }
    ],
    "links": {
      "github": "https://github.com/zyang0009",
      "linkedin": "https://www.linkedin.com/in/ziyang0009/"
    },
    "projects": [
      {
        "title": "Horsing Around: Analysis on Tipster Profitability in Horse Race Betting",
        "link": "https://github.com/zyang0009/CapstoneHorsinAround",
        "time": {
          "start": "October 2020",
          "end": "October 2020"
        },
        "description": "Can I make money using tipsters in horse race betting? This project uses statistical modeling to determine the likelihood of making money following tipsters' tips. "
      },
      {
        "title": "Natural Language Processing: A Study Using Unsupervised Clustering",
        "link": "https://github.com/zyang0009/boardgamenlp",
        "time": {
          "start": "November 2020",
          "end": "November 2020"
        },
        "description": "A study of unsupervised clustering. Using NLP on boardgame descriptions, cluster games based on key words and assigning category title latent topics of each cluster. These topics are then compared with pre-assigned categories using word clouds. Results show congruent key words in categories. "
      },
      {
        "title": "Boardgame Recommender: A Content-based Recommendation Model for Boardgame Lovers",
        "link": "https://github.com/zyang0009/boardgamerecommender",
        "time": {
          "start": "December 2020",
          "end": "Janurary 2021"
        },
        "description": "Using LDA to create a description-based boardgame recommender for boardgame lovers. Flask is used to deploy the recommender website. Data analysis and visualization is used to confirm usability."
      }
    ],
    "experience": [
      {
        "organization": "NovaWurks, Inc",
        "title": "Project Engineer",
        "time": {
          "start": "April 2019",
          "end": "August 2020"
        },
        "description": "Oversaw all engineering, project, and management aspects of a multi-million dollar project with multiple government agencies on the design and development of an economical, modular and reconfigurable small satellite."
      },
      {
        "organization": "US Navy",
        "title": "Surface Warfare Officer - Nuclear, Active Duty",
        "time": {
          "start": "May 2013",
          "end": "Feburary 2019"
        },
        "description": "Directly controls the entire propulsion and power generating source and equipment to meet combat and service needs of over 6,000 sailors. Carry out appropriate response to dynamic evolutions and rapid change in power demands while maintaining perfect compliance to written procedures.Deployment to Operation Inherent Resolve 2018."
      }
    ],
    "certificates": [
      {
        "organization": "Galvanize LA",
        "title": "Data Science Certificate",
        "time": {
          "start": "October 2020",
          "end": "Janurary 2021"
        },
        "description": "A 13-week immersive bootcamp with 700+ hours of coding, weekly Case Studies, and three capstone projects. Python-based curriculum focused on machine learning and best practices in statistical analysis, including frequentist and Bayesian methods. Utilizes regression, classification, and clustering to model real-world structured and unstructured data."
      },
      {
        "organization": "US Navy",
        "title": "Master of Science Equivalent, Nuclear Engineer",
        "time": {
          "start": "September 2015",
          "end": "June 2018"
        },
        "description": "Master of Nuclear Engineering equivalent training in the US Navy Nuclear Program. Coursework includes Physics, Chemistry, Calculus, Nuclear Reactor Theory and Design. Includes over 500 hours of on-the-job training as Shift Manager of operating navy nuclear engineering power plants. "
      }
    ]
  },

  "page_elements": {
    "greetings": "Hello, World.",
    "navigation_button": "Learn more about me.",
    "contact_message": "Don't hesitate to contact me."
  }
}
